#概览




典型的用户使用主流程为:
1. 添加云厂商账户；
2. 在集群管理模块创建需要的集群模板；
3. 在扩缩容任务里建立扩缩容任务；

在浏览器中打开 http://localhost:8888 登录系统,采用的认证方式是默认配置可用以下帐号登录
默认用户名:root
默认密码为:admin

### 演示添加云厂商账户如下如下步骤
添加云账户信息
1. 进入云厂商账户，点击添加云账户

2. 填写云厂商的ak和sk信息，并保存；

附录：阿里云如何获取ak和sk
获取AccessKey - 新手上云指南 - 阿里云


### 演示创建机型模板需要如下步骤
创建快速扩容需要的集群模板
1. 集群管理->创建集群

2. 进入云厂商配置页面，进行配置：

3. 点击下一步进入网络配置页面：


4. 网络配置完成后，点击下一步，进行机器规格配置

5. 机器规格配置完成后，点击下一步，进行存储磁盘配置，配置完成后，点击提交，创建集群成功

6. 点击提交，则页面跳转到集群列表，有最新的创建的集群信息，则表示创建成功




### 演示创建快速扩容任务需要如下步骤
建立扩缩容任务
1. 扩缩荣任务->创建任务；

2. 填写扩缩容任务配置，填写完后点击提交按钮；

3. 提交成功后，页面跳转到任务列表，显示刚才创建的任务的执行情况

4. 如果需要查看本次任务创建的机器的IP，可点击执行明细查看详细信息；

